Autodesk.Revit.DB.EntryAndSchemeConsistency
Indicates whether the scheme entry is consistent with the scheme and can be added to it.
Since:
2020
Since:
2020

Autodesk.Revit.DB.EntryAndSchemeConsistency.EntryAlreadyExists
The entry already exists in the scheme and can not be added.

Autodesk.Revit.DB.EntryAndSchemeConsistency.InvalidReference
The color fill scheme entry references invalid element or element which can not be used by scheme parameter.

Autodesk.Revit.DB.EntryAndSchemeConsistency.OutOfRange
The entry value is out of range of valid values of scheme parameter.

Autodesk.Revit.DB.EntryAndSchemeConsistency.InconsistentStorageType
The color fill scheme and the entry have different parameter storage type value.

Autodesk.Revit.DB.EntryAndSchemeConsistency.InconsistentByRangeValue
The color fill scheme and the entry have different ByRange value.

Autodesk.Revit.DB.EntryAndSchemeConsistency.Consistent
The scheme entry can be added to the scheme.